# Решение квадратного уравнения
print('Решение квадратного уравнения вида a*x^2 + b*x + c = 0')

# Пользователь вводит коэфициенты уравнения в список
abc = []
for i in range(3):
    k = int(input('Введите целое число: \n'))
    abc.append(k)

# Вычисляем дискриминант D и определяем количество корней уравнения
D = abc[1] ** 2 - 4*abc[0]*abc[2]
result = []
if D > 0:
    x1 = - abc[1] + D ** 0.5 / 2 * abc[0] * abc[2]
    result.append('x1 = ' + str(x1))
    x2 = - abc[1] - D ** 0.5 / 2 * abc[0] * abc[2]
    result.append('x2 = ' + str(x2))
    print('Корни квадратного уравнения:')
    for i in result:
        print(i)
elif D == 0:
    x1 = - abc[1] / 2 * abc[0] * abc[2]
    print('В уравнении один корень:\nx1 = ', x1)
else:
    print('Корней в уравнении нет!')
    
